In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
import sys
sys.path.append('c:/Pradap/Research/Python-Packages/enrique/')

In [3]:
import magellan as mg

In [4]:
A = mg.read_csv('../magellan/datasets/table_A.csv', key='ID')
B = mg.read_csv('../magellan/datasets/table_B.csv', key='ID')

In [5]:
mg.init_jvm('C:\\Program Files\\Java\\jre7\\bin\\server\\jvm.dll')

True

In [6]:
ab = mg.AttrEquivalenceBlocker()
C = ab.block_tables(A, B, 'zipcode', 'zipcode', l_output_attrs=['name', 'hourly_wage', 'zipcode'],
                    r_output_attrs=['name', 'hourly_wage', 'zipcode'])

In [7]:
C

,_id,ltable.ID,rtable.ID,ltable.name,ltable.hourly_wage,ltable.zipcode,rtable.name,rtable.hourly_wage,rtable.zipcode
0,0,a1,b1,Kevin Smith,30,94107,Mark Levene,29.5,94107
1,1,a1,b2,Kevin Smith,30,94107,Bill Bridge,32,94107
2,2,a1,b6,Kevin Smith,30,94107,Michael Brodie,32.5,94107
3,3,a3,b1,William Bridge,32,94107,Mark Levene,29.5,94107
4,4,a3,b2,William Bridge,32,94107,Bill Bridge,32,94107
5,5,a3,b6,William Bridge,32,94107,Michael Brodie,32.5,94107
6,6,a2,b3,Michael Franklin,27.5,94122,Mike Franklin,27.5,94122
7,7,a2,b4,Michael Franklin,27.5,94122,Joseph Kuan,26,94122
8,8,a2,b5,Michael Franklin,27.5,94122,Alfons Kemper,35,94122
9,9,a4,b3,Binto George,32.5,94122,Mike Franklin,27.5,94122
10,10,a4,b4,Binto George,32.5,94122,Joseph Kuan,26,94122
11,11,a4,b5,Binto George,32.5,94122,Alfons Kemper,35,94122
12,12,a5,b3,Alphonse Kemper,35,94122,Mike Franklin,27.5,94122
13,13,a5,b4,Alphonse Kemper,35,94122,Joseph Kuan,26,94122
14,14,a5,b5,Alphonse Kemper,35,94122,Alfons Kemper,35,94122

In [8]:
E = ab.block_tables(A, B, 'hourly_wage', 'hourly_wage', l_output_attrs=['birth_year'], r_output_attrs=['birth_year'])

In [9]:
E

   _id ltable.ID rtable.ID ltable.birth_year rtable.birth_year
0    0        a2        b3              1988              1988
1    1        a3        b2              1986              1986
2    2        a4        b6              1987              1987
3    3        a5        b5              1984              1984

In [10]:
D = ab.block_candset(C, 'birth_year', 'birth_year')

In [11]:
D

,_id,ltable.ID,rtable.ID,ltable.name,ltable.hourly_wage,ltable.zipcode,rtable.name,rtable.hourly_wage,rtable.zipcode
4,4,a3,b2,William Bridge,32,94107,Bill Bridge,32,94107
6,6,a2,b3,Michael Franklin,27.5,94122,Mike Franklin,27.5,94122
14,14,a5,b5,Alphonse Kemper,35,94122,Alfons Kemper,35,94122

In [12]:
F = mg.combine_block_outputs_via_union([D, E])

In [13]:
F

,_id,ltable.ID,rtable.ID,ltable.birth_year,ltable.hourly_wage,ltable.name,ltable.zipcode,rtable.birth_year,rtable.hourly_wage,rtable.name,rtable.zipcode
0,0,a2,b3,1988,27.5,Michael Franklin,94122,1988,27.5,Mike Franklin,94122
1,1,a4,b6,1987,32.5,Binto George,94122,1987,32.5,Michael Brodie,94107
2,2,a3,b2,1986,32.0,William Bridge,94107,1986,32.0,Bill Bridge,94107
3,3,a5,b5,1984,35.0,Alphonse Kemper,94122,1984,35.0,Alfons Kemper,94122

In [14]:
S = mg.sample_one_table(C, 10)

In [15]:
L = mg.label(S, 'gold_label')

In [16]:
feat_table = mg.get_features_for_blocking(A, B)

WARNING:magellan.feature.autofeaturegen:address type and address type are different

In [17]:
feat_table

,feature_name,left_attribute,right_attribute,left_attr_tokenizer,right_attr_tokenizer,simfunction,function,function_source
0,ID_ID_lev,ID,ID,None,None,lev,<function ID_ID_lev at 0x0000000012F32C88>,from magellan.feature.simfunctions import *\nf...
1,name_name_jac_qgm_3_qgm_3,name,name,qgm_3,qgm_3,jaccard,<function name_name_jac_qgm_3_qgm_3 at 0x00000...,from magellan.feature.simfunctions import *\nf...
2,name_name_jac_qgm_2_qgm_3,name,name,qgm_2,qgm_3,jaccard,<function name_name_jac_qgm_2_qgm_3 at 0x00000...,from magellan.feature.simfunctions import *\nf...
3,birth_year_birth_year_rdf,birth_year,birth_year,None,None,rel_diff,<function birth_year_birth_year_rdf at 0x00000...,from magellan.feature.simfunctions import *\nf...
4,hourly_wage_hourly_wage_rdf,hourly_wage,hourly_wage,None,None,rel_diff,<function hourly_wage_hourly_wage_rdf at 0x000...,from magellan.feature.simfunctions import *\nf...
5,zipcode_zipcode_rdf,zipcode,zipcode,None,None,rel_diff,<function zipcode_zipcode_rdf at 0x0000000012F...,from magellan.feature.simfunctions import *\nf...

In [18]:
s_prime = mg.extract_feat_vecs(L, attrs_before=None, feat_table=feat_table, attrs_after=['gold_label'])

In [19]:
s_prime

,_id,ltable.ID,rtable.ID,ID_ID_lev,name_name_jac_qgm_3_qgm_3,name_name_jac_qgm_2_qgm_3,birth_year_birth_year_rdf,hourly_wage_hourly_wage_rdf,zipcode_zipcode_rdf,gold_label
0,0,a1,b1,0.5,0.000000,0,0,0.008403,0,0
1,1,a1,b2,0.0,0.000000,0,0,0.032258,0,0
2,2,a1,b6,0.0,0.000000,0,0,0.040000,0,0
3,3,a3,b2,0.0,0.400000,0,0,0.000000,0,1
4,4,a3,b6,0.0,0.043478,0,0,0.007752,0,0
5,5,a2,b3,0.0,0.388889,0,0,0.000000,0,1
6,6,a2,b4,0.0,0.000000,0,0,0.028037,0,0
7,7,a4,b4,0.5,0.000000,0,0,0.111111,0,0
8,8,a5,b4,0.0,0.000000,0,0,0.147541,0,0
9,9,a5,b5,0.5,0.333333,0,0,0.000000,0,1

In [20]:
from magellan.feature.simfunctions import *
from magellan.feature.tokenizers import *

In [21]:
feat_table.ix[1, 'function'](A.ix[1], B.ix[2])

0.3888888888888889